extends BaseMapObjEvent


class_name MapObjFoodEvent

@export var eat_times_remaining = 5	## 剩余被进食次数
@export var eat_value = 10 ## 每次进食获得的饱腹感

# ##############################################################################
# funcs
# ##############################################################################


func ready():
	super.ready()
	obj_type = E_ObjType.Food


# ##############################################################################
# END
# ##############################################################################
